app/views/users/show.html.erb

                    <% if booking.user %>
                      <p><%= link_to booking.user.first_name.capitalize, booking.user  %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

                <p><%= link_to "View Ride", booking.ride %></p>
                  <p><b>Your Driver:</b> <%= booking.ride.user.first_name.capitalize %> <%= booking.ride.user.last_name.capitalize %><br>
---
SELECT "rides".* FROM "rides" WHERE "rides"."user_id" = ?  [["user_id", 1]]