app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "review", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["rating", 3], ["review", "A++++"], ["user_id", 11], ["created_at", "2016-07-21 19:24:27.858464"], ["updated_at", "2016-07-21 19:24:27.858464"]]
---
  def create
    @review = @user.reviews.build(review_params)


    if @review.save