app/controllers/rides_controller.rb

  def index
    @rides = Ride.all
---
SELECT "rides".* FROM "rides"

  def show
    @alt_color = true
    @ride = Ride.find(params[:id])
---
SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", 0]]

  def create
    @ride = Ride.new(ride_params)
    @ride.user_id = current_user.id
    @ride.completed = false
    if @ride.save
---
INSERT INTO "rides" ("date", "time", "seats_available", "comments", "start_location", "end_location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)