app/controllers/users_controller.rb

  def show
    @alt_color = true
    @user = User.find(params[:id])
    @rides = @user.rides
    #FIX THIS BELOW TO SHOW ALL REVIEWS FOR USER
    #@reviews = @user.rides.all.reviews

    #FIX THIS BELOW TO SHOW ALL My Bookings
    #and The bookings made for my ride offered
    @reviews = @user.reviews

    # if @review = Review.find_by(user_id: @user.id)
    #   @review
    # else
      # @review = @user.reviews.build
    # end

    @bookings = []
    @rides.each do |ride|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "rides".* FROM "rides" WHERE "rides"."user_id" = ?  ORDER BY "rides"."id" ASC LIMIT 1  [["user_id", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "gender", "date_of_birth", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "salt", "crypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "avatar_updated_at" = ?, "avatar_file_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar_updated_at", "2016-07-20 19:31:08.852087"], ["avatar_file_name", "circle_arrow2.png"], ["updated_at", "2016-07-20 19:31:08.965099"], ["id", 1]]